# Конфигурация бота Магнитогорского Политехнического Колледжа
SCHEDULE_URL = "https://magpk.ru/studentu/raspisanie-zanyatij"

# Все учебные группы
ALL_GROUPS = [
    "АСУ9-25",
    "АТ9-23", "АТ9-24", "АТ9-25",
    "МК-24", "МК-25", "МК11-25",
    "МЛ-22-1", "МЛ-22-2", "МЛ-23-1", "МЛ-23-2", "МЛ-24-1", "МЛ-24-2",
    "МР9-22", "МР9-23", "МР9-24", "МР9-25",
    "МС-23", "МС-24", "МС-25",
    "МЧМ9-22", "МЧМ9-23", "МЧМ9-24-1", "МЧМ9-24-2", "МЧМ9-25",
    "ОБ9-22-1", "ОБ9-22-2", "ОБ9-23-1", "ОБ9-23-2",
    "ОБ9-24-1", "ОБ9-24-2", "ОБ9-25-1", "ОБ9-25-2",
    "ОМ9-22-1", "ОМ9-22-2", "ОМ9-23",
    "ОМ9-24-1", "ОМ9-24-2", "ОМ9-25-1", "ОМ9-25-2",
    "ОС9-22", "ОС9-23", "ОС9-24",
    "ПК-22", "ПК-23", "ПК-24", "ПК-25",
    "ПМЛт-25-2", "ПМЛэ-25-1",
    "ПО9-25",
    "СП9-22", "СП9-23", "СП9-24", "СП9-25",
    "ТГ9-22", "ТГ9-23", "ТГ9-24", "ТГ9-25",
    "ТК9-22-1", "ТК9-22-2", "ТК9-23-1", "ТК9-23-2", "ТК9-24", "ТК9-25",
    "ТМ9-22-1", "ТМ9-22-2", "ТМ9-23-1", "ТМ9-23-2",
    "ТМ9-24-1", "ТМ9-24-2", "ТМ9-25-1", "ТМ9-25-2",
    "ТЭ9-22", "ТЭ9-23", "ТЭ9-24-1", "ТЭ9-24-2", "ТЭ9-25",
    "УП9-23", "УП9-24", "УП9-25",
    "ЭС9-25",
]

# Временные слоты пар
LESSON_TIMES = {
    1: "08:00 – 09:35",
    2: "09:45 – 11:20",
    3: "11:35 – 13:10",
    4: "13:30 – 15:05",
    5: "15:15 – 16:50",
    6: "17:00 – 18:35",
    7: "18:40 – 20:15",
}

# Дни недели на русском
WEEKDAYS_RU = {
    0: "Понедельник", 1: "Вторник", 2: "Среда",
    3: "Четверг", 4: "Пятница", 5: "Суббота", 6: "Воскресенье"
}

# Администрирование бота
import os
ADMIN_IDS = [8510857913]
env_admin_ids = os.getenv("ADMIN_IDS")
if env_admin_ids:
    for x in env_admin_ids.split(","):
        if x.strip().isdigit():
            ADMIN_IDS.append(int(x.strip()))

ADMIN_PASSWORD = os.getenv("ADMIN_PASSWORD", "12344321")
DB_ENCRYPTION_KEY = os.getenv("DB_ENCRYPTION_KEY", "magpk_secure_key_2026")
DONATE_LINK = os.getenv("DONATE_LINK", "https://www.tbank.ru/cf/2ljNourHecO")
GOOGLE_SHEET_URL = os.getenv("GOOGLE_SHEET_URL", "")
